stm32-rs/stm32f4xx-hal/src/spi.rs
    SPI6:
        SCK: [
            NoSck,
            PG13<Alternate<AF5>>
        ]
        MISO: [
            NoMiso,
            PG12<Alternate<AF5>>
        ]
        MOSI: [
            NoMosi,
            PG14<Alternate<AF5>>
        ]
}

#[cfg(any(feature = "stm32f446"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF7>>]

    SPI3:
        SCK: []
        MISO: []
        MOSI: [
            PB0<Alternate<AF7>>,
            PB2<Alternate<AF7>>,
            PD0<Alternate<AF6>>
        ]

    SPI4:
        SCK: [PG11<Alternate<AF6>>]
        MISO: [
            PG12<Alternate<AF6>>,
            PD0<Alternate<AF5>>
        ]
        MOSI: [PG13<Alternate<AF6>>]
}

#[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF5>>]
}

#[derive(Debug)]
pub struct Spi<SPI, PINS> {
    spi: SPI,
    pins: PINS,
}

macro_rules! hal {
    ($($SPIX:ident: ($spiX:ident, $apbXenr:ident, $spiXen:ident, $pclkX:ident),)+) => {
        $(
            impl<PINS> Spi<$SPIX, PINS> {
                pub fn $spiX(
                    spi: $SPIX,
                    pins: PINS,
                    mode: Mode,
                    freq: Hertz,
                    clocks: Clocks
                ) -> Self
                where PINS: Pins<$SPIX> {
                    // NOTE(unsafe) This executes only during initialisation
                    let rcc = unsafe { &(*RCC::ptr()) };

                    // Enable clock for SPI
                    rcc.$apbXenr.modify(|_, w| w.$spiXen().set_bit());

                    // disable SS output
                    spi.cr2.write(|w| w.ssoe().clear_bit());

                    let br = match clocks.$pclkX().0 / freq.0 {
                        0 => unreachable!(),
                        1...2 => 0b000,
                        3...5 => 0b001,
                        6...11 => 0b010,
                        12...23 => 0b011,
                        24...47 => 0b100,
                        48...95 => 0b101,
                        96...191 => 0b110,
                        _ => 0b111,
                    };

                    // mstr: master configuration
                    // lsbfirst: MSB first
                    // ssm: enable software slave management (NSS pin free for other uses)
                    // ssi: set nss high = master mode
                    // dff: 8 bit frames
                    // bidimode: 2-line unidirectional
                    // spe: enable the SPI bus
                    spi.cr1.write(|w| {
                        w.cpha()
                            .bit(mode.phase == Phase::CaptureOnSecondTransition)
                            .cpol()
                            .bit(mode.polarity == Polarity::IdleHigh)
                            .mstr()
                            .set_bit()
                            .br()
                            .bits(br)
                            .lsbfirst()
                            .clear_bit()
                            .ssm()
                            .set_bit()
                            .ssi()
                            .set_bit()
                            .rxonly()
                            .clear_bit()
                            .dff()
                            .clear_bit()
                            .bidimode()
                            .clear_bit()
                            .spe()
                            .set_bit()
                    });

                    Spi { spi, pins }
                }

                /// Enable transmit register empty interrupt
                pub fn enable_txe_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() | (1 << 7))});
                }

                /// Disable transmit register empty interrupt
                pub fn disable_txe_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() & !(1 << 7))});
                }

                /// Enable receive register not empty interrupt
                pub fn enable_rxne_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() | (1 << 6))});
                }

                /// Disable receive register not empty interrupt
                pub fn disable_rxne_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() & !(1 << 6))});
                }

                /// Enable error interrupt
                pub fn enable_error_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() | (1 << 5))});
                }

                /// Disable error interrupt
                pub fn disable_error_interrupt(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() & !(1 << 5))});
                }

                /// Convenience function to enable all interrupts
                pub fn enable_interrupts(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() | (7 << 5))});
                }

                /// Convenience function to disable all interrupts
                pub fn disable_interrupts(&mut self) {
                    self.spi.cr2.modify(|r, w| unsafe {w.bits(r.bits() & !(7 << 5))});
                }

                /// Enable the peripheral, i.e. set the SPE bit in the SPI control register 1
                pub fn enable(&mut self) {
                    self.spi.cr1.modify(|r, w| unsafe {w.bits(r.bits() | (1 << 6))});
                }

                /// Halt the SPI according to the procedure described in chapter
                /// 28.3.8 of the STM32F4xx reference manual
                // TODO: this only applies to master bi-directional transfer mode
                pub fn wait_until_idle(&mut self) {
                    while self.spi.sr.read().rxne().bit_is_clear() {}
                    while self.spi.sr.read().txe().bit_is_clear()  {}
                    while self.spi.sr.read().bsy().bit_is_set()    {}
                }

